Tutorials/kOmegaSSTStab/constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      environmentalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel	0.00;

// A list of the relaxation zones in the simulation. The parameters are given
// in <name>Coeffs below.
relaxationNames ();

initializationName inlet;

inletCoeffs
{
        waveType	streamFunction;
	Tsoft 0;
    N		32;
    depth	0.400000;
    omega	3.141593;
    phi		0.000000;
    waveNumber	 (1.658977 0.0 0.0);
    uBar	1.91744;
    A		nonuniform List<scalar>	32
    (
        0.0569921
        0.0177233
        0.00498286
        0.00146619
        0.000462558
        0.000154781
        5.40911e-05
        1.95117e-05
        7.20848e-06
...
    );
    B		nonuniform List<scalar>	32
    (
        0.294319
        0.0906356
        0.018986
        0.00246699
        2.50031e-05
        -7.61927e-05
        -1.81364e-05
        -9.45787e-07
        6.46195e-07
...
    );


}
initCoeffs
{
    waveType            potentialCurrent;
    U                   ( 0 0 0 );
    Tsoft               2;
    N		32;
    depth	0.400000;
    omega	3.141593;
    phi		0.000000;
    waveNumber	 (1.658977 0.0 0.0);
    uBar	1.91744;
    A		nonuniform List<scalar>	32
    (
        0.0569921
        0.0177233
        0.00498286
        0.00146619
        0.000462558
        0.000154781
        5.40911e-05
        1.95117e-05
        7.20848e-06
...
    );
    B		nonuniform List<scalar>	32
    (
        0.294319
        0.0906356
        0.018986
        0.00246699
        2.50031e-05
        -7.61927e-05
        -1.81364e-05
        -9.45787e-07
        6.46195e-07
...
    );

    // Specifications on the relaxation zone shape and relaxation scheme
  
}
initCoeffs
{
    waveType            potentialCurrent;
    U                   ( 0 0 0 );
    Tsoft               2;
}
// ************************************************************************* //
